Tekla.Structures.CatalogInternal.CatalogInternalOperation.ModifyProfileItemProperties(System.String,Tekla.Structures.Catalogs.ProfileItemCrossSection)
Modifies the properties of given profile name base on cross section number.
profileName: The profile name.
profileItemCrossSection: The profile item cross section.
Returns: True on success.